app/controllers/tb_tuercas_controller.rb

SELECT * FROM "tb_tuercas"
---
  def index
    @tb_tuercas = TbTuerca.all

SELECT * FROM "tb_tuercas" WHERE ("tb_tuercas"."id" = 7)
---
  def show
    @tb_tuerca = TbTuerca.find(params[:id])

SELECT * FROM "tb_tuercas" WHERE ("tb_tuercas"."id" = 3)
---
  def edit
    @tb_tuerca = TbTuerca.find(params[:id])

INSERT INTO "tb_tuercas" ("nombre", "num_lados", "dimension", "estado", "tolerancia") VALUES('a', 4, 12.0, 'Activo', 1.0)
---
  def create
    @tb_tuerca = TbTuerca.new(params[:tb_tuerca])

    respond_to do |format|
      if @tb_tuerca.save

SELECT * FROM "tb_tuercas" WHERE ("tb_tuercas"."id" = 11)
UPDATE "tb_tuercas" SET "tolerancia" = 1.5 WHERE "id" = 11
---
  def update
    @tb_tuerca = TbTuerca.find(params[:id])

    respond_to do |format|
      if @tb_tuerca.update_attributes(params[:tb_tuerca])

SELECT * FROM "tb_tuercas" WHERE ("tb_tuercas"."id" = 10)
DELETE FROM "tb_tuercas" WHERE "id" = 10
---
  def destroy
    @tb_tuerca = TbTuerca.find(params[:id])
    @tb_tuerca.destroy